In [1]:
import pandas as pd
import numpy as np

In [2]:
data_url='https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df_data=pd.read_csv(data_url,sep='\s+',header=None)

In [3]:
df_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [4]:
df_data.columns=['CRIM','ZN','INDUS','CHAS','NOX','RM','AGE','DIS','RAD','TAX','PTRATIO','B','LSTAT','MEDV']
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [5]:
df_data.values

array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 3.9690e+02, 4.9800e+00,
        2.4000e+01],
       [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 3.9690e+02, 9.1400e+00,
        2.1600e+01],
       [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 3.9283e+02, 4.0300e+00,
        3.4700e+01],
       ...,
       [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 5.6400e+00,
        2.3900e+01],
       [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 3.9345e+02, 6.4800e+00,
        2.2000e+01],
       [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 3.9690e+02, 7.8800e+00,
        1.1900e+01]])

<h2>series = 한 데이터 프레임의 각각의 열값들</h2>
<p>이라 생각하자...</p>

In [6]:
#list type으로 바로 series 데이터 만들고 index 설정 가능
list_data=[1,2,3,4,5]
series_data=pd.Series(index=['a','b','c','d','e'],data=list_data)
series_data

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
#dic type 도 문제 없음
dic_data={'a':1,'b':2,'c':3,'d':4,'e':5}
series_data=pd.Series(data=dic_data,dtype=np.float32)  
series_data

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
dtype: float32

In [8]:
series_data['c']=300
series_data

a      1.0
b      2.0
c    300.0
d      4.0
e      5.0
dtype: float32

<h2>DataFrame </h2>

In [9]:
raw_data={'num':[1,2,3,4,5],'alpha':['a','b','c','d','e'],'ALPHA' :['A','B','C','D','E']}
df=pd.DataFrame(raw_data,columns=['alpha','ALPHA','num']) #순서 지정 가능
df

  alpha ALPHA  num
0     a     A    1
1     b     B    2
2     c     C    3
3     d     D    4
4     e     E    5

<h2>series을 부르는 두가지 방법</h2>

In [10]:
df.num

0    1
1    2
2    3
3    4
4    5
Name: num, dtype: int64

In [11]:
df['num']

0    1
1    2
2    3
3    4
4    5
Name: num, dtype: int64

<h2>dataframe indexing & slicing</h2>

In [12]:
df.head()

  alpha ALPHA  num
0     a     A    1
1     b     B    2
2     c     C    3
3     d     D    4
4     e     E    5

In [13]:
# df.loc[ index의 값]
df.loc[0] # 각 행 데이터들이 나온다.

alpha    a
ALPHA    A
num      1
Name: 0, dtype: object

In [14]:
df_temp=df.copy()
df_temp.index=['aa','bb','cc','dd','ee']
df_temp.loc['cc'] # 이건 index 명으로 location을 지점

alpha    c
ALPHA    C
num      3
Name: cc, dtype: object

In [15]:
df_temp.loc[:'dd']

   alpha ALPHA  num
aa     a     A    1
bb     b     B    2
cc     c     C    3
dd     d     D    4

In [16]:
df_temp.loc[:,['num','alpha']]

    num alpha
aa    1     a
bb    2     b
cc    3     c
dd    4     d
ee    5     e

In [17]:
df_temp.iloc[0] #이건 index순으로 location지정

alpha    a
ALPHA    A
num      1
Name: aa, dtype: object

In [18]:
df_temp.iloc[:3]

   alpha ALPHA  num
aa     a     A    1
bb     b     B    2
cc     c     C    3

In [19]:
df['num'][0]

1

In [20]:
df[0:2]

  alpha ALPHA  num
0     a     A    1
1     b     B    2

In [21]:
df[['alpha','num']][2:3] # df[['alpha','num']][3]은 안댐

  alpha  num
2     c    3

In [22]:
df['alpha'] # series 데이터

0    a
1    b
2    c
3    d
4    e
Name: alpha, dtype: object

In [23]:
df[['alpha']] #dataframe

  alpha
0     a
1     b
2     c
3     d
4     e

In [24]:
#series   series
df['num'][df['num']<3]

0    1
1    2
Name: num, dtype: int64

In [25]:
#series type
df['num'][[0,2,4]]

0    1
2    3
4    5
Name: num, dtype: int64

In [26]:
df.loc[[1,3],['num','alpha']]

   num alpha
1    2     b
3    4     d

<h2>새로운 col  추가</h2>

In [27]:
df.columns

Index(['alpha', 'ALPHA', 'num'], dtype='object')

In [28]:
df=pd.concat([df,pd.Series([11,22,33,44,55],name='new')],axis=1)

In [29]:
df.new>10

0    True
1    True
2    True
3    True
4    True
Name: new, dtype: bool

<h2>del 삭제</h2>

In [30]:
del df['new']

<h2>data drop</h2>

In [31]:
df_temp=df.copy()
df_temp

  alpha ALPHA  num
0     a     A    1
1     b     B    2
2     c     C    3
3     d     D    4
4     e     E    5

In [32]:
df_temp.drop(0) # df_temp.drop(1,inplace=True) 로 하면 원본 데이터인 df_temp의 값이 사라진다.

  alpha ALPHA  num
1     b     B    2
2     c     C    3
3     d     D    4
4     e     E    5

In [33]:
df_temp.drop([0,1,2])

  alpha ALPHA  num
3     d     D    4
4     e     E    5

In [34]:
df_temp.drop('num',axis=1)

  alpha ALPHA
0     a     A
1     b     B
2     c     C
3     d     D
4     e     E

<h2>series & dataframe opetation</h2>

In [35]:
s1=pd.Series(range(1,6),index=list('abced'))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [36]:
s2=pd.Series(range(100,106),index=list('bcedef'))
s2

b    100
c    101
e    102
d    103
e    104
f    105
dtype: int64

In [37]:
# 같은 index 끼리 연산, 공통된 index가 아니면 NaN값이 들어감
s1+s2 # s1.add(s2)

a      NaN
b    102.0
c    104.0
d    108.0
e    106.0
e    108.0
f      NaN
dtype: float64

In [38]:
df1=pd.DataFrame(np.arange(0,9).reshape(3,3),columns=list('abc'))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [39]:
df2=pd.DataFrame(np.arange(16).reshape(4,4),columns=list('abfd'))
df2

    a   b   f   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [40]:
df1+df2 # series와 마찬가지로 같은 이름의 col끼리 더해지고 나머지는 NaN

      a     b   c   d   f
0   0.0   2.0 NaN NaN NaN
1   7.0   9.0 NaN NaN NaN
2  14.0  16.0 NaN NaN NaN
3   NaN   NaN NaN NaN NaN

In [41]:
df1.add(df2,fill_value=0) # fill_value 를 설정해주면 빈 곳에 0이 들어간다.

#밑의 output을 보면 c 3 값은 NaN이 되어 있는데 이는 index 'c'는 df1에만 있고, 번호는 0~2까지 있기 때문에 그런거 같다.

      a     b    c     d     f
0   0.0   2.0  2.0   3.0   2.0
1   7.0   9.0  5.0   7.0   6.0
2  14.0  16.0  8.0  11.0  10.0
3  12.0  13.0  NaN  15.0  14.0

In [42]:
df3=pd.DataFrame(np.arange(12).reshape(4,3),columns=list('abc'))
df3

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [43]:
df2.add(df3,fill_value=0) # df1 df2 연산과는 다르게 NaN이 없는것을 확인 할 수 있다.

    a   b     c     d     f
0   0   2   2.0   3.0   2.0
1   7   9   5.0   7.0   6.0
2  14  16   8.0  11.0  10.0
3  21  23  11.0  15.0  14.0

In [44]:
df1  #이랑 series 연산을 해보자

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [45]:
s1=pd.Series(np.arange(100,103))
s1

0    100
1    101
2    102
dtype: int32

In [46]:
df1.add(s1,axis=0)

     a    b    c
0  100  101  102
1  104  105  106
2  108  109  110

In [47]:
df1.add(s1,axis=1)

    a   b   c   0   1   2
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN

<h2>lambda   ,  map</h2>

In [48]:
s1=pd.Series(np.arange(10))
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [49]:
s1.map(lambda x : x**2).head()

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [50]:
dict_data={1:'A',2:'B',3:'C'} #dict type을 이용해 series 값을 바꿀 수 있다.
s1.map(dict_data).head()

0    NaN
1      A
2      B
3      C
4    NaN
dtype: object

In [51]:
s2=pd.Series(np.arange(100,105)) #마찬가지로 series 를 이용해 바꿀 수 있다.
s1.map(s2)

0    100.0
1    101.0
2    102.0
3    103.0
4    104.0
5      NaN
6      NaN
7      NaN
8      NaN
9      NaN
dtype: float64

<h2>apply</h2>

In [52]:
df_info=df[['num']]

In [53]:
f= lambda x:x.max()-x.min()
df_info.apply(f)

num    4
dtype: int64

In [54]:
#applymap 을 쓰면 모든 데이터에 함수 f를 적용 시킬 수 있다.
f= lambda x: -x
df_info.applymap(f)

   num
0   -1
1   -2
2   -3
3   -4
4   -5

In [55]:
#sclar 외 series도 가능하다
def f(x):
    return pd.Series([x.min(),x.max()],index=['min','max'])
df_info.apply(f)

     num
min    1
max    5

In [56]:
df_info

   num
0    1
1    2
2    3
3    4
4    5

<h2>pandas 라이브러리</h2>

In [57]:
df=pd.read_csv('movie_rating.csv')
df.head()

          critic               title  rating
0  Jack Matthews   Lady in the Water     3.0
1  Jack Matthews   Snakes on a Plane     4.0
2  Jack Matthews   You Me and Dupree     3.5
3  Jack Matthews    Superman Returns     5.0
4  Jack Matthews  The Night Listener     3.0

In [58]:
df.critic.unique()

array(['Jack Matthews', 'Mick LaSalle', 'Claudia Puig', 'Lisa Rose',
       'Toby', 'Gene Seymour'], dtype=object)

In [59]:
df_temp=df.copy()
df_temp.replace(['Jack Matthews', 'Mick LaSalle', 'Claudia Puig', 'Lisa Rose','Toby', 'Gene Seymour'],[x for x in range(6)],inplace=True)
df_temp.head()

   critic               title  rating
0       0   Lady in the Water     3.0
1       0   Snakes on a Plane     4.0
2       0   You Me and Dupree     3.5
3       0    Superman Returns     5.0
4       0  The Night Listener     3.0

In [60]:
df.isnull().sum()  #nu;; 값 개수를 찾음

critic    0
title     0
rating    0
dtype: int64

In [61]:
# 사실 비평가 index랑 rating이랑 무슨 상관관계가 있나 싶지만 그냥 구해 보았다..
df_temp.rating[(df_temp.rating>3.0)].corr(df_temp.critic)

-0.07418318309487705